# define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//位操作符	（都是指二进制位）
//  & 按位与   
//  | 按位或
//  ^ 按位异或
//  ~ 按位取反
//  它们的操作数必须是整数
//  位操作符是直接对二进制位进行操作的

//
//int main()
//{
//	//整数在内存中的存储是以补码的形式存储的
//	int a = 3;     //00000000 00000000 00000000 00000011  -- 3的补码
//	int b = -5;    //11111111 11111111 11111111 11111011  -- -5的补码
//	int c = a & b; //00000000 00000000 00000000 00000011  将a和b的二进制位进行按位与操作，有0则为0，都是1则为1，得到的结果转换为十进制为3
//	printf("c = %d\n", c);
//
//	int d = a | b; //11111111 11111111 11111111 11111011  将a和b的二进制位进行按位或操作，有1则为1，都是0则为0，得到的结果转换为十进制为-5
//	printf("d = %d\n", d);
//	
//	int e = a ^ b; //11111111 11111111 11111111 11111000  将a和b的二进制位进行按位异或操作，相同则为0，不同则为1，得到的结果转换为十进制为-8
//	printf("e = %d\n", e);
//
//	return 0;
//}

//
////不创建临时变量交换两个数的值
//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("交换前：a = %d b = %d\n", a, b);
//	//异或操作符的性质：a ^ a = 0; a ^ 0 = a; a ^ b = b ^ a;
//	a = a ^ b;//a = 3 ^ 5
//	b = a ^ b;//b = 3 ^ 5 ^ 5
//	a = a ^ b;//a = 3 ^ 5 ^ 3
//	printf("交换后：a = %d b = %d\n", a, b);
//
//	return 0;
//}


//编写代码，求一个整数存储在内存中的二进制中1的个数
//int main()
//{
//	int num = 0;
//	int count = 0;
//
//
//	return 0;
//}
//

//赋值操作符
//  =
//  赋值操作符的优先级比较低
//  赋值操作符的结合性是从右向左
//  a = x = y + 1;  先计算y+1，然后将结果赋值给x，然后将x的值赋值给a		但是不应该这么写，可读性不高




//复合操作符
//  += -= *= /= %= &= |= ^= <<= >>=
//  a += b;  a = a + b; 其他的类似





//单目操作符(只有一个操作数)
//  ! 逻辑非 ~ 按位取反 ++前置、后置  -- 前置、后置  + 正号 - 负号  & 取地址 
// * 间接访问操作符
//每个整型占4个字节，而取地址取的是第一个字节的地址
//  sizeof 操作数的类型长度，单位是字节
//  sizeof(数据类型)  sizeof(表达式)   sizeof既可以计算类型所创建的变量的内存大小，
// 也可以计算表达式的内存大小， 变量的大小
//  
//如果放入数组名，计算的是整个数组的大小

// ~ 对二进制位按位取反
//int main()
//{
//	//int a = 0;
//	////00000000 00000000 00000000 00000000 - a的补码
//	////11111111 11111111 11111111 11111111 - a的按位取反
//	////11111111 11111111 11111111 11111110 - a的按位取反后的反码
//	////10000000 00000000 00000000 00000001 - a的按位取反后的原码  值是-1
//	//printf("%d\n", ~a);//  -1
//
//	int a = 13;
//	//00000000 00000000 00000000 00001101 - a的补码
//	//要将特定位置的0变为1，可以使用或操作符
//	int b = a | (1 << 5);//00000000 00000000 00000000 00100000
//
//	//要将特定位置的1变为0，可以使用与操作符
//	int c = a & ~(1 << 3);//00000000 00000000 00000000 00000101
//	return 0;
//}
//
//
//int main()
//{
//	int a = 10;
//	int* p = &a;
//	*p = 20;// *是间接访问操作符，通过指针间接访问变量
//	return 0;
//}



//看懂下面的代码加强对sizeof的理解
//void test(int arr[])
//{
//	printf("%d\n", sizeof(arr));//4
//}
//void test2(char ch[])
//{
//	printf("%d\n", sizeof(ch));//4
//}
//
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));//40
//	printf("%d\n", sizeof(ch));//10
//	test(arr);
//	test2(ch);
//	return 0;
//}


//关系操作符
//  > < >= <= == !=
